export default Object.freeze({
  /* IVR */
  _1: {
    code: -1
  },

  /* global 00 */
  _200001: {
    code: 200001,
    msg: '請聯繫系統管理員。'
  },
  _200002: {
    code: 200002,
    // msg: '系統錯誤，請聯繫系統管理員。'
    msg: '看來出了一點意料之外的狀況...'
  },
  _200003: {
    code: 200003,
    msg: '登入逾時，請重新登入。'
  },
  _200004: {
    code: 200004,
    msg: '登入逾時，請重新登入。'
  },
  _200005: {
    code: 200005,
    msg: '帳號已無法使用，請聯繫系統管理員。'
  },
  _200006: {
    code: 200006,
    msg: '使用者無此權限。'
  },
  _200007: {
    code: 200007,
    msg: '無異動。'
  },
  /** accessToken & refreshToken 過期 */
  _200008: {
    code: 200008,
    msg: '登入逾時，請重新登入。'
  },
  /** accessToken 過期 */
  _200009: {
    code: 200009,
    msg: '登入逾時，請重新登入。'
  },

  /** auth 21 */
  _210001: {
    code: 210001,
    msg: '帳號或密碼錯誤。'
  },
  /** member 22 */
  _220001: {
    code: 220001,
    msg: '會員已存在。'
  },
  _220002: {
    code: 220002,
    msg: '姓名僅支援中英文。'
  },
  _220003: {
    code: 220003,
    msg: '密碼不一致。'
  },
  _220004: {
    code: 220004,
    msg: '好友推薦碼不存在。'
  },
  _220005: {
    code: 220005,
    msg: '會員不存在。'
  },
  _220006: {
    code: 220006,
    msg: '手機號碼已存在。'
  },
  _220007: {
    code: 220007,
    msg: 'Excel 資料上傳錯誤。'
  },
  _220008: {
    code: 220008,
    msg: '上傳 Excel 格式錯誤，僅支援 .xls 與 .xlsx 格式。'
  },
  _220009: {
    code: 220009,
    msg: '上傳 Excel 大小超過限制，檔案大小限制 2M 以下。'
  },
  _220010: {
    code: 220010,
    msg: '特殊類型不存在。'
  },
  _220011: {
    code: 220011,
    msg: '欄位有空值→ 列數：'
  },
  _220012: {
    code: 220012,
    msg: '查無會員：'
  },
  _220013: {
    code: 220013,
    msg: '會員重複：'
  },
  _220014: {
    code: 220014,
    msg: '修改特殊會員類型失敗。'
  },
  _220015: {
    code: 220015,
    msg: '刪除特殊會員類型失敗。'
  },
  _220016: {
    code: 220016,
    msg: '批量儲存特殊會員類型失敗。'
  },
  _220017: {
    code: 220017,
    msg: '積點格式有誤：'
  },
  _220018: {
    code: 220018,
    msg: '若為自定區間，起訖日為必填'
  },
  _220019: {
    code: 220019,
    msg: '特殊會員類型名稱重複'
  },
  _220020: {
    code: 220020,
    msg: '上傳 Csv 格式錯誤，僅支援 .csv 格式。'
  },
  _220021: {
    code: 220021,
    msg: '上傳 Csv 檔案錯誤。'
  },
  _220022: {
    code: 220022,
    msg: 'Csv 資料上傳錯誤，無資料。'
  },
  _220023: {
    code: 220023,
    msg: 'Csv 暫存表不存在。'
  },
  _220024: {
    code: 220024,
    msg: '匯出 Csv 檔案錯誤，類型不存在。'
  },
  _220025: {
    code: 220025,
    msg: '匯出 Csv 檔案錯誤，無資料。'
  },
  _220026: {
    code: 220026,
    msg: '登入失敗，請洽詢系統管理員。'
  },
  _220027: {
    code: 220027,
    msg: '所有欄位資料為空，請重新上傳'
  },
  _220028: {
    code: 220028,
    msg: '密碼格式錯誤，請輸入8碼內英數字、符號@$%^&=._'
  },

  /** brand 23 */
  _230001: {
    code: 230001,
    msg: '查無此品牌。'
  },
  _230002: {
    code: 230002,
    msg: '門市數量與渠道數量必須為0，才可刪除。'
  },
  _230003: {
    code: 220003,
    msg: '集團品牌不可刪除。'
  },
  _230004: {
    code: 230004,
    msg: '集團必須為第一個。'
  },
  _230005: {
    code: 230005,
    msg: '品牌代碼重複。'
  },
  _230006: {
    code: 230006,
    msg: '品牌名稱重複'
  },
  _230007: {
    code: 230007,
    msg: '門市數量與渠道數量必須為0，才可編輯品牌代碼。'
  },
  _230008: {
    code: 230008,
    msg: '修改品牌設定排序失敗。'
  },

  /** store 24 */
  _240001: {
    code: 240001,
    msg: '查無此門市。'
  },
  _240002: {
    code: 240002,
    msg: 'POS 商店代碼重複。'
  },

  /** channel 25 */
  _250001: {
    code: 250001,
    msg: 'CRM後台必須為第一個'
  },
  _250002: {
    code: 250002,
    msg: '渠道代碼不存在。'
  },
  _250003: {
    code: 250003,
    msg: '修改渠道排序失敗。'
  },
  _250004: {
    code: 250004,
    msg: '修改渠道設定失敗。'
  },

  /** memberShip 26 */
  _260001: {
    code: 260001,
    msg: '會籍預定生效日必須大於今日。'
  },
  _260002: {
    code: 260002,
    msg: '會籍預定生效日不可與其他生效中、待生效的會籍版本相同。'
  },
  _260003: {
    code: 260003,
    msg: '會籍項目為空時僅可儲存草稿。'
  },
  _260004: {
    code: 260004,
    msg: '會籍資料最多十個。'
  },
  _260005: {
    code: 260005,
    msg: '會籍設定名稱重複。'
  },
  _260007: {
    code: 260007,
    msg: '生效中的會籍設定無法刪除。'
  },
  _260008: {
    code: 260008,
    msg: '會籍設定不存在。'
  },
  _260009: {
    code: 260009,
    msg: '生效中的會籍設定無法編輯。'
  },
  _260010: {
    code: 260010,
    msg: '生效中的會籍設定無法發佈。'
  },
  _260011: {
    code: 260011,
    msg: '待生效中的會籍設定無法儲存草稿。'
  },
  _260012: {
    code: 260012,
    msg: '儲存會籍設定失敗。'
  },
  _260013: {
    code: 260013,
    msg: '僅可複製啟用中的會籍設定。'
  },
  _260014: {
    code: 260014,
    msg: '複製的會籍無法編輯'
  },

  /** holiday 27 */
  _270001: {
    code: 270001,
    msg: '西元日期錯誤：'
  },
  _270002: {
    code: 270002,
    msg: '儲存假日設定失敗。'
  },
  /** order 28 */
  _280001: {
    code: 280001,
    msg: '補登交易類型設置錯誤。'
  },
  _280002: {
    code: 280002,
    msg: '消費紀錄不存在。'
  },
  _280003: {
    code: 280003,
    msg: '交易序號已存在。'
  },
  _280004: {
    code: 280004,
    msg: '交易序號不存在。'
  },
  _280005: {
    code: 280005,
    msg: '已超出原訂單金額。'
  },
  _280006: {
    code: 280006,
    msg: '交易日期超出原訂單交易日期。'
  },
  _280007: {
    code: 280007,
    msg: '該票券已無法退貨。'
  },
  _280008: {
    code: 280008,
    msg: '票券退貨失敗。'
  },
  _290009: {
    code: 290009,
    msg: '僅限匯出起迄區間一個月內的訂單資料。'
  },
  _290010: {
    code: 290010,
    msg: '尚無明細可供下載。'
  },
  _290011: {
    code: 290011,
    msg: '補登失敗。'
  },

  /** mealPeriod 29 */
  _290001: {
    code: 290001,
    msg: '餐期名稱重複'
  },
  _290002: {
    code: 290002,
    msg: '餐期代碼重複'
  },
  _290003: {
    code: 290003,
    msg: '餐期名稱過長'
  },
  _290004: {
    code: 290004,
    msg: '餐期代碼過長'
  },
  /** payment 30 */
  _300001: {
    code: 300001,
    msg: '支付名稱重複'
  },
  _300002: {
    code: 300002,
    msg: '代碼重複'
  },
  _300003: {
    code: 300003,
    msg: '支付方式名稱過長'
  },
  _300004: {
    code: 300004,
    msg: '支付方式代碼過長'
  },
  _300005: {
    code: 300005,
    msg: '支付方式不存在。'
  },
  /** image */
  _310001: {
    code: 310001,
    msg: '圖檔類型不符，僅接受PNG、JPEG、JPG、GIF。'
  },
  _310002: {
    code: 310002,
    msg: '上傳檔案數量錯誤。'
  },
  _310003: {
    code: 310003,
    msg: '圖檔超過限制'
  },
  _310004: {
    code: 310004,
    msg: '圖檔尺寸為'
  },
  /** coupon 32 */
  _320001: {
    code: 320001,
    msg: '兌換券不存在。'
  },
  _320002: {
    code: 320002,
    msg: '兌換券尚未開始才可刪除。'
  },
  _320003: {
    code: 320003,
    msg: '兌換券發放事件不存在。'
  },
  _320004: {
    code: 320004,
    msg: '指定發放日需設定大於今天的日期。'
  },
  _320005: {
    code: 320005,
    msg: '兌換券已達領取上限。'
  },
  _320006: {
    code: 320006,
    msg: '已開始的兌換券，發行數量不可低於已領取數量。'
  },
  _320007: {
    code: 320007,
    msg: '發送資料不存在。'
  },
  _320008: {
    code: 320008,
    msg: '已達執行時間，不可刪除。'
  },
  _320009: {
    code: 320009,
    msg: '已結束，不可編輯。'
  },
  _320010: {
    code: 320010,
    msg: '修改兌換券設定詳細資料失敗。'
  },
  _320011: {
    code: 320011,
    msg: '刪除兌換券設定詳細資料失敗。'
  },
  _320012: {
    code: 320012,
    msg: '修改兌換券發放詳細資料失敗。'
  },
  _320013: {
    code: 320013,
    msg: '刪除兌換券發放詳細資料失敗。'
  },
  _320014: {
    code: 320014,
    msg: '轉贈兌換券失敗。'
  },
  _320015: {
    code: 320015,
    msg: '兌換優惠券/商品券失敗。'
  },
  _320016: {
    code: 320016,
    msg: '核銷方式錯誤。'
  },
  _320017: {
    code: 320017,
    msg: '核銷失敗，兌換券狀態錯誤：'
  },
  _320018: {
    code: 320018,
    msg: '退貨失敗。'
  },
  _320019: {
    code: 320019,
    msg: '退貨失敗，非普通兌換和非集點卡兌換發放規則。'
  },
  _320020: {
    code: 320020,
    msg: '退貨失敗，轉贈狀態不可退貨。'
  },
  _320021: {
    code: 320021,
    msg: '票券不可轉贈。'
  },
  _320022: {
    code: 320022,
    msg: '兌換失敗，尚未進入兌換時間。'
  },
  _320023: {
    code: 320023,
    msg: '編輯失敗，進行中只可編輯下架時間、兌換結束日期、發佈狀態、發行數量、使用說明。'
  },
  _320024: {
    code: 320024,
    msg: '紅利點數不足，兌換失敗。'
  },
  _320025: {
    code: 320025,
    msg: '兌換券已核銷，無法再次核銷'
  },
  _320026: {
    code: 320026,
    msg: '兌換券已轉贈，無法核銷'
  },
  _320027: {
    code: 320027,
    msg: '兌換券已退貨，無法核銷'
  },
  _320028: {
    code: 320028,
    msg: '兌換券已到期，無法核銷'
  },
  _320029: {
    code: 320029,
    msg: '兌換券可使用，無法取消核銷'
  },
  _320030: {
    code: 320030,
    msg: '兌換券已轉贈，無法取消核銷'
  },
  _320031: {
    code: 320031,
    msg: '兌換券已退貨，無法取消核銷'
  },
  _320032: {
    code: 320032,
    msg: '兌換券已到期，無法取消核銷'
  },
  _320033: {
    code: 320033,
    msg: '無法核銷，請確認兌換券使用限制（例：限定品牌、門市）'
  },
  _320034: {
    code: 320034,
    msg: '無法取消核銷，請確認兌換券使用限制（例：限定品牌、門市）'
  },
  _320035: {
    code: 320035,
    msg: '無法核銷，請確認編碼是否正確'
  },
  _320036: {
    code: 320036,
    msg: '無法取消核銷，請確認編碼是否正確'
  },

  /** permission 33 */
  _330001: {
    code: 330001,
    msg: '帳號重複，請重新填寫。'
  },
  _330002: {
    code: 300002,
    msg: '確認密碼未輸入。'
  },
  _330003: {
    code: 330003,
    msg: '密碼為8~20位數的英數混合。'
  },
  _330004: {
    code: 330004,
    msg: '確認密碼與密碼不同，請重新輸入。'
  },
  _330005: {
    code: 330005,
    msg: '角色重複。'
  },
  _330006: {
    code: 330006,
    msg: '角色首頁錯誤。'
  },
  _330007: {
    code: 330007,
    msg: '管理員無法更動。'
  },

  /** commodity 34 */
  _340001: {
    code: 340001,
    msg: '新增商品資訊失敗。'
  },
  _340002: {
    code: 340002,
    msg: '編輯商品資訊失敗。'
  },
  _340003: {
    code: 340003,
    msg: '新增失敗，已存在的商品編號與品牌。'
  },
  _340004: {
    code: 340004,
    msg: '新增失敗，查無品牌。'
  },
  _340005: {
    code: 340005,
    msg: '新增失敗，查無門市。'
  },
  /** rewardCard */
  _350001: {
    code: 350001,
    msg: '集點卡不存在。'
  },
  _350002: {
    code: 350002,
    msg: '滿點自動兌換，僅有一個兌換券才可啟用。'
  },
  _350003: {
    code: 350003,
    msg: '集點卡尚未開始才可刪除。'
  },
  _350004: {
    code: 350004,
    msg: '集點卡發放資料不存在'
  },
  _350005: {
    code: 350005,
    msg: '該品牌上下架時間不可有重疊時段。'
  },
  _350006: {
    code: 350006,
    msg: '編輯失敗，已結束的集點卡不可編輯。'
  },
  _350007: {
    code: 350007,
    msg: '上下架時間錯誤，不可設置已結束集點卡。'
  },
  _350008: {
    code: 350008,
    msg: '兌換失敗，票券不可兌換。'
  },
  _350009: {
    code: 350009,
    msg: '刪除集點卡調整項目失敗。'
  },
  _350010: {
    code: 350010,
    msg: '刪除集點卡調整項目失敗，已結束的集點卡調整項目不可刪除。'
  },
  _350011: {
    code: 350011,
    msg: '兌換失敗，集點點數不足。'
  },
  /** notify 36 */
  _360001: {
    code: 360001,
    msg: '通知分類不存在。'
  },
  _360002: {
    code: 360002,
    msg: '此通知分類下已存在人員數量。'
  },
  _360003: {
    code: 360003,
    msg: '通知分類名稱已存在。'
  },
  _360004: {
    code: 360004,
    msg: '通知人員不存在。'
  },
  _360005: {
    code: 360005,
    msg: '資料重複:'
  },
  _360006: {
    code: 360006,
    msg: '通知分類不存在:'
  },
  _360007: {
    code: 360007,
    msg: 'Excel 資料不存在。'
  },
  _360008: {
    code: 360008,
    msg: '手機號碼有誤:'
  },
  _360009: {
    code: 360009,
    msg: '人員暱稱格式有誤:'
  },
  _360010: {
    code: 360010,
    msg: 'Email 格式有誤:'
  },

  /** 積點管理 37 */
  _370001: {
    code: 370001,
    msg: '尚未開始的活動才可刪除。'
  },
  _370002: {
    code: 370002,
    msg: '開始時間需早於結束時間。'
  },
  _370003: {
    code: 370003,
    msg: '若積點效期為指定天數，則天數為必填。'
  },
  _370004: {
    code: 370004,
    msg: '進行中的活動才可停用。'
  },
  _370005: {
    code: 370005,
    msg: '尚未開始的調整項目才可刪除。'
  },
  _370006: {
    code: 370006,
    msg: '積點調整時間選指定發放日的話時間為必填。'
  },
  _370007: {
    code: 370007,
    msg: '指定會員調整積點國碼、電話、積點為必填。'
  },
  _370008: {
    code: 370008,
    msg: '增點時積點效期必填。'
  },
  _370009: {
    code: 370009,
    msg: '批量匯入請選擇檔案。'
  },
  _370010: {
    code: 370010,
    msg: '尚未開始的調整項目才可複製。'
  },
  _370011: {
    code: 370011,
    msg: '消費日必須小於等於今日。'
  },

  /** common */
  _380001: {
    code: 380001,
    msg: '查無會員。'
  },
  /** 標籤管理 39 */
  _390001: {
    code: 390001,
    msg: '不存在的標籤分類'
  },
  _390002: {
    code: 390002,
    msg: '修改標籤分類排序'
  },
  _390003: {
    code: 390003,
    msg: '不存在的標籤'
  },
  _390004: {
    code: 390004,
    msg: '標籤名稱已重複'
  },
  _390005: {
    code: 390005,
    msg: '標籤不存在'
  },
  _390006: {
    code: 390006,
    msg: '刪除標籤失敗，貼標人數必須為０'
  },
  _390007: {
    code: 390007,
    msg: '新增會員標籤失敗'
  },
  _390008: {
    code: 390008,
    msg: '刪除會員標籤失敗'
  },
  /** cluster 分群 40 */
  _400001: {
    code: 400001,
    msg: '修改分群通用設定失敗'
  },
  _400002: {
    code: 400002,
    msg: '修改分群設定失敗'
  },
  _400003: {
    code: 400003,
    msg: '分群設定不存在'
  },
  _400004: {
    code: 400004,
    msg: '分群設定格式錯誤'
  },
  _400005: {
    code: 400005,
    msg: '分群設定不可空值'
  },
  _400006: {
    code: 400006,
    msg: '刪除分群設定失敗'
  },

  /** mot 41  */
  _410001: {
    code: 410001,
    msg: '請輸入含http:// 或 https:// 之完整網址。'
  },
  _410002: {
    code: 410002,
    msg: '請先完成內容設定。'
  },
  _410003: {
    code: 410003,
    msg: '請先完成 APP 推播內容設定。'
  },
  _410004: {
    code: 410004,
    msg: '請先完成 SMS 內容設定。'
  },
  _410005: {
    code: 410005,
    msg: '請先完成 Email 內容設定。'
  },
  _410006: {
    code: 410006,
    msg: '請選擇檔案。'
  },
  _410007: {
    code: 410007,
    msg: '請選擇目標受眾。'
  },
  _410008: {
    code: 410008,
    msg: '目標受眾僅能選擇十項。'
  },
  _410009: {
    code: 410009,
    msg: '發送方式為簡訊時不能發送全部會員。'
  },
  _410010: {
    code: 410010,
    msg: '排除條件僅能選擇五項。'
  },
  _410011: {
    code: 410011,
    msg: '發送時間起始日必須大於今日。'
  },

  /* sms 42 */
  _420001: {
    code: 420001,
    msg: '簡訊發送失敗。'
  }
});
